* Notes

** Emacs Shortcuts

Save |  Ctrl-X ,  Ctrl-S

Clear Buffers | Ctrl-X , 1

Split Vert| Ctrl-X , 3

Split Hor | Ctrl-X , 2

Directory | Ctrl-X , Ctrl-D

Compiling | Ctrl-C , Ctrl-C

Shell | Alt-X , "Shell"

Change Buffers | Ctrl-X , B

Kill Buffer | Ctrl-X , K

Exit Emacs | Ctrl-X , Ctrl-C

Undo | Ctrl-X , U

Copy | Alt-W

Paste | Ctrl-Y

Cut | Ctrl-W

Delete Line | Crtl-K

Clock In | Ctrl-C , Ctrl-X , Ctrl-I

Clock Out | Ctrl-C , Ctrl-X , Ctrl-O

End-of-file | Ctrl-D



** C++ Keywords
alignas **
alignof **
and
and_eq
asm
auto
bitand
bitor
bool *
break
case
catch	char
char16_t **
char32_t **
class
compl
const
constexpr **
const_cast *
continue
decltype
default
delete	do
double
dynamic_cast *
else
enum
explicit *
export *
extern
false *
float
for
friend	goto
if
inline
int
long
mutable *
namespace *
new
noexcept **
not
not_eq
nullptr **	operator
or
or_eq
private
protected
public
register
reinterpret_cast *
return
short
signed
sizeof	static
static_assert **
static_cast *
struct
switch
template
this
thread_local **
throw
true *
try
typedef	typeid *
typename *
union
unsigned
using *
virtual
void
volatile
wchar_t *
while
xor
xor_eq


** Emails From MC

--------------------------------------------------------------------------------
1. copy files from green USB key for boost and wt. copy them into ~/Development.
2. unpack boost:

tar -xaf boost_1_66_0.tar.bz2

3. build boost:

cd boost_1_66_0/
./bootstrap.sh
./b2 --prefix=/home/marco/local
./b2 --prefix=/home/marco/local --install

replace "marco" with your username, here and on all other commands below.

4. when boost is finished, you can start with witty. unpack witty:

tar -xaf witty-4.0.2.tar.gz

5. build witty:

cd wt-4.0.2
set CMAKE_INCLUDE_PATH=/home/marco/local/include
set CMAKE_LIBRARY_PATH=/home/marco/local/lib
mkdir build
cmake ..
make -j 2
make install

6. create a new project, and add the following to the CMake file (in
addition to what you normally add) add the following:

6.1 after the project:

find_package(Wt REQUIRED)

6.2 after the target (e.g. the line with target_link_libraries):

target_link_libraries(PROJECT ${Wt_LIBRARIES})

7. manually copy the contents of this file:

https://www.webtoolkit.eu/wt/src/hello

8. build and run it. you need to run it with the following parameters:

./PROJECT  --docroot . --http-address 0.0.0.0 --http-port 8080

9. go to chrome and type:

http://localhost:8080

if all goes well you should see the hello world.
----------------------------------------------------------------------------------


* Tasks

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-01-12 Fri 17:39]
| <75>                                                                        |         |      |   |       |
| Headline                                                                    | Time    |      |   |     % |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| *Total time*                                                                | *16:59* |      |   | 100.0 |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| Tasks                                                                       | 16:59   |      |   | 100.0 |
| Setup CMake                                                                 |         | 0:46 |   |   4.5 |
| Reviewing yesterdays Grades task                                            |         | 2:13 |   |  13.1 |
| Copy across hello world from wt (And how to run wt)                         |         | 0:50 |   |   4.9 |
| Adding numbers on wt                                                        |         | 0:44 |   |   4.3 |
| Watch tutorials on youtube                                                  |         | 2:03 |   |  12.1 |
| Attempt to use wt solo                                                      |         | 1:24 |   |   8.2 |
| Practice C++                                                                |         | 1:28 |   |   8.6 |
| Reading "Learn C++" chapter 1                                               |         | 2:00 |   |  11.8 |
| Cleaning up tasks.org                                                       |         | 0:16 |   |   1.6 |
| Making 21 game                                                              |         | 4:38 |   |  27.3 |
| Comparing NI and mines 21 games                                             |         | 0:37 |   |   3.6 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:

** Setup CMake
   CLOCK: [2018-01-04 Thu 13:29]--[2018-01-04 Thu 14:15] =>  0:46

- link to tutorial: http://derekmolloy.ie/hello-world-introductions-to-cmake/
- read tutorial and setup cmake

** Reviewing yesterdays Grades task
   CLOCK: [2018-01-09 Tue 09:48]--[2018-01-09 Tue 12:01] =>  2:13

-Changing small parts of the code and seeing the results
-Double: next level of float. More decimal places (kinda)
-setPrecision: Sets the decimal precision to be used to format floating-point
values on output operations.

** Installed Wt
** Copy across hello world from wt (And how to run wt)
   CLOCK: [2018-01-09 Tue 14:10]--[2018-01-09 Tue 14:21] =>  0:11
   CLOCK: [2018-01-09 Tue 13:30]--[2018-01-09 Tue 14:09] =>  0:39

- To run:
./hellowt --docroot . --http-listen 0.0.0.0:8080
-Compile Adress template:
cd ~/Development/HelloWorld/hellowt/build && CMAKE_INCLUDE_PATH=/home/patrick/local/include CMAKE_LIBRARY_PATH=/home/patrick/local/lib cmake .. && make -j4
** Adding numbers on wt
   CLOCK: [2018-01-09 Tue 15:02]--[2018-01-09 Tue 15:46] =>  0:44
** Watch tutorials on youtube
   CLOCK: [2018-01-10 Wed 14:14]--[2018-01-10 Wed 15:29] =>  1:15
   CLOCK: [2018-01-10 Wed 13:04]--[2018-01-10 Wed 13:52] =>  0:48

- watch youtube videos sent by MC and N

** Attempt to use wt solo
   CLOCK: [2018-01-10 Wed 15:37]--[2018-01-10 Wed 17:01] =>  2:24

- Trying to recreate something on a web page using wt

** Practice C++
   CLOCK: [2018-01-11 Thu 14:31]--[2018-01-11 Thu 15:17] =>  0:46
   CLOCK: [2018-01-11 Thu 09:32]--[2018-01-11 Thu 10:14] =>  0:42


-Trying to create something in C++ without looking at ref
-Try to incorporate all that I've learned

** Reading "Learn C++" chapter 1
   CLOCK: [2018-01-11 Thu 16:24]--[2018-01-11 Thu 17:02] =>  0:38
   CLOCK: [2018-01-11 Thu 13:09]--[2018-01-11 Thu 13:37] =>  0:28
   CLOCK: [2018-01-11 Thu 10:58]--[2018-01-11 Thu 11:52] =>  0:54


-Complete Chapter 1
-Leaving the questions until the end
-Upto: 1.11
** Cleaning up tasks.org
   CLOCK: [2018-01-11 Thu 13:44]--[2018-01-11 Thu 14:00] =>  0:16
** Making 21 game
   CLOCK: [2018-01-12 Fri 16:32]--[2018-01-12 Fri 17:04] =>  0:32
   CLOCK: [2018-01-12 Fri 15:12]--[2018-01-12 Fri 16:08] =>  0:56
   CLOCK: [2018-01-12 Fri 13:12]--[2018-01-12 Fri 14:50] =>  1:38
   CLOCK: [2018-01-12 Fri 11:06]--[2018-01-12 Fri 12:14] =>  1:08
   CLOCK: [2018-01-12 Fri 10:20]--[2018-01-12 Fri 10:44] =>  0:24

- randomly generate number for player and cpu
- hide cpu cards
- ask player if they'd like to hit
- ask cpu if they'd like to hit
- when player holds ask cpu
- when both hold, reveal cpu cards
- annouce winner
- ask if they would like to play again
** Comparing NI and mines 21 games
   CLOCK: [2018-01-12 Fri 16:12]--[2018-01-12 Fri 16:30] =>  0:18
   CLOCK: [2018-01-12 Fri 14:50]--[2018-01-12 Fri 15:09] =>  0:19

- do {
        whatever
     } while ( !condition );
- break;
